ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/ble.c
char* fetch_name(uint16_t length)
{
    char* name = malloc(sizeof(char[MAX_STRING_SIZE])); //max size of name string

    for(int i = 0; i < length; i++)
    {
        *(name + i) = nus_data_global[parser_trace + i];  
    }

    memset((name + length), NULL, (MAX_STRING_SIZE - length)); 
    string_length = length; 
    parser_trace += length;

    return name; 
}


uint32_t char_string_to_int(uint8_t digits)
{   
    char num_string[digits];
    uint8_t hex_bcd[digits]; 
    uint32_t accumulator = 0; 

    for(int i = 0; i < digits; i++)
    {
        num_string[i] = nus_data_global[parser_trace + i];
        hex_bcd[i] = num_string[i] - 0x30; 
        accumulator += (hex_bcd[i] * pow(10, digits-i-1)); 
    }
    return accumulator; 
}



char* ble_parse_name(void) //pass in all offsets
{
    //char string_len[2];
    char *name;

    uint32_t data_length = ble_parse_data_length(); 
    name = fetch_name(data_length); //offset is 6 

    return name;
} 



uint32_t ble_parse_data_length(void)
{
    char num_chars = nus_data_global[parser_trace]; //ascii for number of characters in length 
    parser_trace += 1;
    uint8_t i = num_chars - 0x30; //get int from ascii 
    uint32_t data_length = char_string_to_int(i);
    parser_trace += i; 

    return data_length;
}


void add_project(void)
{   
    char *project_name;
    uint8_t project_name_length;
    project_name = ble_parse_name(); 
    project_name_length = string_length; //not used 
    
    flash_add_project(project_name);
}


void add_chip(void)
{
    char *chip_name;
    uint8_t chip_name_length; // not used 
    char *project_name;
    uint8_t project_name_length;
    //uint8_t chip_id[WORD_SIZE] = {0, 0, 0, 0}; //TODO malloc and fetch actual chip ID, currently global 

    chip_name = ble_parse_name();
    chip_name_length = string_length;
    
    project_name = ble_parse_name();
    project_name_length = string_length;

    //Seek to parent based on name
    uint32_t project_addr = seek_to_project(project_name, project_name_length); //projects start at 4096, 52 bytes per project 
    if(project_addr == NULL)
    {   
        //ERROR: no project found
        nrf_gpio_pin_set(LED_RED);
    }
    
    flash_add_chip(project_addr, chip_name, chip_id, false);
}



uint32_t add_file(void)
{
    char* file_name;
    uint8_t file_name_length; 
    char* chip_name;
    uint8_t chip_name_length;
    char* project_name;
    uint8_t project_name_length;
     
    file_name = ble_parse_name();
    file_name_length = string_length; 
    chip_name = ble_parse_name();
    chip_name_length = string_length;
    project_name = ble_parse_name();
    project_name_length = string_length;

    file_data_length = ble_parse_data_length(); 
    
    prog_flag = true; //flags nus handler to start appending incoming data 
    
    // flash seek functions
    uint32_t project_addr = seek_to_project(project_name, project_name_length); //projects start at 4096, 52 bytes per project 
    if(project_addr == NULL)
    {   
        //ERROR: no project found
        nrf_gpio_pin_set(LED_RED);
    }
    uint32_t chip_addr = seek_to_chip(project_addr, chip_name, chip_name_length); //chips start at addr 8192, 56 bytes per chip 
    if(chip_addr == NULL)
    {   
        //ERROR: no chip found
        nrf_gpio_pin_set(LED_RED);
    }

    file_header_write(chip_addr, file_name, NULL, file_data_length, false); //write file header and append file addr to chip 
    
    return chip_addr; 
} 

void add_all(void)
{
    char* file_name;
    uint8_t file_name_length; 
    char* chip_name;
    uint8_t chip_name_length;
    char* project_name;
    uint8_t project_name_length;
     
    file_name = ble_parse_name();
    file_name_length = string_length; 
    chip_name = ble_parse_name();
    chip_name_length = string_length;
    project_name = ble_parse_name();
    project_name_length = string_length;

    file_data_length = ble_parse_data_length(); 

    prog_flag = true; //flags nus handler to start appending incoming data
    
    uint32_t project_addr = flash_add_project(project_name);
    uint32_t chip_addr = flash_add_chip(project_addr, chip_name, chip_id, true);
    file_header_write(chip_addr, file_name, NULL, file_data_length, true);
    
    


}


void packet_write_first(void)
{
    //read file bytes programmed
    //update file in flash with data_address?
    //append data as its received 
    //increment global file counter  
     
    uint32_t bytes_prog = fetch_bytes_prog(); 
    file_data_addr_global = bytes_prog + DATA_SECTOR_START; 
    flash_write(nus_data_global, file_data_addr_global, BLE_PACKET_SIZE); //NOTE WORD WRITES ONLY, write remaining file data from first ble packet after header
}

void packet_write(uint32_t data_start_addr)
{
    flash_write(nus_data_global, data_start_addr, BLE_PACKET_SIZE);
}


void ble_cmd_parser(void)
{
    if(nus_data_global[0] == 'C' && nus_data_global[1] == 'C') //start byte == "CC" 
    {
        char cmd[2]; 

        cmd[0] = nus_data_global[2];
        cmd[1] = nus_data_global[3];
        parser_trace = 4; 

        if(cmd[0] == '1' && cmd[1] =='0') //add project 
        {
            add_project(); 
        }
        else if(cmd[0] == '2' && cmd[1] =='0') //add chip 
        {
            // add chip to parent project in flash
            add_chip(); 
        }
        else if(cmd[0] == '3' && cmd[1] =='0') //add file 
        {
            // add file to parent chip and project in flash
            chip_addr_global = add_file(); 
        }
        else if(cmd[0] == '0' && cmd[0] =='0') //add all
        {
            add_all(); 
            add_all_mode = true; 
        }
        else if(cmd[0] == '4' && cmd[1] =='0') //delete project 
        {
            //delete_project();
        }
        else if(cmd[0] == '5' && cmd[1] =='0') //delete chip 
        {
            //delete_chip(); 
        }
        else if(cmd[0] == '6' && cmd[1] =='0') //delete file
        {
            //delete_file(); //NOTE: how to reuse empty data storage after deletion?
        }
        else if(cmd[0] == 'F' && cmd[1] =='F') //erase device
        {
            flash_init(); //reset flash
            hibernate(); // reset device
        }
        //TODO free names after writing to flash

        parser_trace = 0; //reset for next command
    }
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */

