ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/ble.c
void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {        
        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            nus_data_global[i] = p_evt->params.rx_data.p_data[i];
        }
        if(!prog_flag)
        {
            ble_cmd_parser(); 
            current_byte_pos = file_data_length;
        }
        else // prog flag true, start file write
        {
           if(current_byte_pos > 0)
            {   
                if(packet_index == 0)
                {
                    packet_write_first(); //calculate start address and write first packet
                    packet_index++;
                    current_byte_pos -= BLE_PACKET_SIZE; // subtract bytes programmed 
                }
                else
                {
                    uint32_t current_addr = (packet_index * BLE_PACKET_SIZE) + file_data_addr_global; //global assigned in packet_write_first(); 
                    packet_write(current_addr); 

                    //append entire nus_data_global array to file data in flash
                    //exception for last file (usually not full 244 bytes) 

                    packet_index++;
                    current_byte_pos -= BLE_PACKET_SIZE; 
                }
            }
            if(current_byte_pos <= 0)
            {
                //(AFTER PROGRAMMING COMPLETE)
                prog_flag = false;
                if(!add_all_mode)
                {
                    flash_file_num_inc(chip_addr_global);  //increment file_num in chip parent in flash
                }
                else
                {
                    add_all_mode = false; 
                }
                flash_file_dir_update(file_data_length); //increment file_count_global and file_bytes_programmed in flash
                

                //NOTE FOR TEST 
//                uint8_t data_buff[FLASH_SECTOR_SIZE];
//                flash_read(data_buff, 0, FLASH_SECTOR_SIZE);
//
//                uint8_t data_buff1[FLASH_SECTOR_SIZE];
//                flash_read(data_buff1, CHIPS_START_ADDR, FLASH_SECTOR_SIZE);
//                prog_flag = true;
//
//                uint8_t data_buff2[FLASH_SECTOR_SIZE];
//                flash_read(data_buff2, FILES_START_ADDR, FLASH_SECTOR_SIZE);
//                prog_flag = true;
            }
        }
    }
}


/**@brief Function for initializing services that will be used by the application.
 */
void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
            idle_state_handle();
            break;
        default:
            break;
    }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
void ble_draw_icon(uint16_t color)
{
    //SSD1351_draw_line(x0, y0, x1, y1, uint16_t color)

//    small ble logo
//    SSD1351_draw_line( 5, 10, 9, 14, color); // draw x
//    SSD1351_draw_line( 5, 14, 9, 10, color);
//    SSD1351_draw_line( 7, 8, 7, 16, color); // draw vertical line
//    SSD1351_draw_line( 7, 8, 9, 10, color); // close two triangles
//    SSD1351_draw_line( 7, 16, 9, 14, color);

